org/python/pytest.org
#+TITLE: Pytest
#+KEYWORDS: python, test, pytest
#+OPTIONS: H:3 toc:2 num:3 ^:nil
#+LANGUAGE: en-US
#+AUTHOR: ChrisChen
#+EMAIL: ChrisChen3121@gmail.com
#+SETUPFILE: ../../org-templates/level-1.org
#+STARTUP: inlineimages
* Intro
** Test Discovery
   - Test files should be named ==test_<something>.py= or =<something>_test.py=.
   - Test methods and functions should be named =test_<something>=.
   - Test classes should be named =Test<Something>=.

** Useful Options
   - ~--collect-only~
   - ~-v, --verbose~
   - ~-x, --exitfirst~: useful when debugging a problem
   - ~-s, --capture=method~: method should be one of =fd|sys|no=. ~-s~ is shortcut for ~--capture=no~
   - ~–lf, --last-failed~: only run last failing tests, or use ~–ff, –failed-first~
   - ~-l, --showlocals~: local variables and their values are displayed with tracebacks for failing tests
   - ~--tb=style~: useful styles =short=, =line=, and =no=
   - ~--durations=N~: show N slowest setup/test durations (N=0 for all), helpful to speed up testing

** Plugin Options
   - ~--pdb~
   - ~--cov~, ~--cov-report=html~

* Markers
  Markers are one of the best ways to mark a subset of your test functions so that they can be run together.
  #+BEGIN_SRC python
    import pytest

    @pytest.mark.somemark
    def test_func():
        pass
  #+END_SRC
  #+BEGIN_SRC bash
    pytest -v -m 'some mark'
  #+END_SRC
** Skip Test on Some Versions
   #+BEGIN_SRC python
     @pytest.mark.skipif(tasks.__version__ < ​'0.2.0'​,
                         reason=​'not supported until version 0.2.0'​)
   #+END_SRC

** Parametrized
   Parametrized testing is a way to send multiple sets of data through the same test and
   have pytest report if any of the sets failed. ~@pytest.mark.parametrize~
   #+BEGIN_SRC python
     @pytest.mark.parametrize('arg1,arg2', [(1, 'arg2_value1'), (2, 'arg2_value2')])
   #+END_SRC

* Fixtures
** Tracing Fixture Execution
   - ~--setup-show~

** Data Fixture
   #+BEGIN_SRC python
     @pytest.fixture(name='show_on_result', scope='session')
     def a_tuple():
         return (1, 2, 3)
   #+END_SRC

** Fixtures for Resource
   #+BEGIN_SRC python
     @pytest.fixture()
     def resource():
         # Setup
         yield
         # Teardown
   #+END_SRC

** Specifying Fixtures with ~usefixtures~
   - ~@pytest.mark.usefixtures('fixture1', 'fixture2')~

** Fixture Scope
   function(default), class, module, session
*** Class Scope
    - need to use ~usefixtures~
   #+BEGIN_SRC python
     # class scope
     @pytest.fixture(scope=​'class'​)
     ​def​ class_scope():
         """A class scope fixture."""

     @pytest.mark.usefixtures(​'class_scope'​)
     class TestClass:
         def test_method(self):
             # use class_scope fixture
             pass
   #+END_SRC

** Autouse Fixture
   - ~@pytest.fixture(autouse=True)~

** Renaming Fixture
   - ~@pytest.fixture(name='simple')~
   - Use ~--fixtures~ option to list all the fixtures available for the test

** *Parametrizing Fixtures*
   - ~@pytest.fixture(params=tasks_to_try, ids=task_ids)~
   - With parametrized fixtures, every test function that uses that fixture will be called multiple times.
   - Use ~ids~ to specify fixture identities.
* Builtin Fixtures
