python/pytest.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en-US" xml:lang="en-US">
<head>
<!-- 2020-07-14 Tue 14:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Pytest</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ChrisChen" />
<meta name="keywords" content="python, test, pytest" />
<link rel="stylesheet" type="text/css" href="../styles/demo/css/demo.css"/>
<link href="https://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Pytest</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0a913fe">1. Intro</a>
<ul>
<li><a href="#org6408f8b">1.1. Test Discovery</a></li>
<li><a href="#org8caf55d">1.2. Useful Options</a></li>
<li><a href="#org935c7e8">1.3. Plugin Options</a></li>
</ul>
</li>
<li><a href="#org7efa54d">2. Markers</a>
<ul>
<li><a href="#org0c0c07d">2.1. Skip Test on Some Versions</a></li>
<li><a href="#org072bb04">2.2. Parametrized</a></li>
</ul>
</li>
<li><a href="#org7bd5b47">3. Fixtures</a>
<ul>
<li><a href="#orgbf92078">3.1. Tracing Fixture Execution</a></li>
<li><a href="#orgeb9e73a">3.2. Data Fixture</a></li>
<li><a href="#org31f67f6">3.3. Fixtures for Resource</a></li>
<li><a href="#org11d01c7">3.4. Specifying Fixtures with <code>usefixtures</code></a></li>
<li><a href="#org3e7d7b9">3.5. Fixture Scope</a></li>
<li><a href="#org94930e5">3.6. Autouse Fixture</a></li>
<li><a href="#org981c29e">3.7. Renaming Fixture</a></li>
<li><a href="#orgf135458">3.8. <b>Parametrizing Fixtures</b></a></li>
</ul>
</li>
<li><a href="#orgaf765f4">4. Builtin Fixtures</a>
<ul>
<li><a href="#orgc700fb9">4.1. <code>tmpdir</code> &amp; <code>tmpdir_factory</code></a></li>
<li><a href="#orgc7acc0d">4.2. request</a></li>
<li><a href="#org0bb7bb5">4.3. pytestconfig</a></li>
<li><a href="#orgdb468ba">4.4. cache</a></li>
<li><a href="#org3d94e99">4.5. capsys</a></li>
<li><a href="#orgbe43414">4.6. monkeypatch</a></li>
<li><a href="#org57432e5">4.7. doctest_namespace</a></li>
<li><a href="#org06427ab">4.8. recwarn</a></li>
</ul>
</li>
<li><a href="#org5ebdc4e">5. Mocks</a></li>
<li><a href="#org13c27ec">6. Asycnio</a>
<ul>
<li><a href="#orgba6d4c4">6.1. <code>pytest-asyncio</code></a></li>
<li><a href="#org2734ecf">6.2. <code>asynctest</code></a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org0a913fe" class="outline-2">
<h2 id="org0a913fe"><span class="section-number-2">1</span> Intro</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org6408f8b" class="outline-3">
<h3 id="org6408f8b"><span class="section-number-3">1.1</span> Test Discovery</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Test files should be named <code>=test_&lt;something&gt;.py</code> or <code>&lt;something&gt;_test.py</code>.</li>
<li>Test methods and functions should be named <code>test_&lt;something&gt;</code>.</li>
<li>Test classes should be named <code>Test&lt;Something&gt;</code>.</li>
</ul>
</div>
</div>

<div id="outline-container-org8caf55d" class="outline-3">
<h3 id="org8caf55d"><span class="section-number-3">1.2</span> Useful Options</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><code>--collect-only</code></li>
<li><code>-v, --verbose</code></li>
<li><code>-x, --exitfirst</code>: useful when debugging a problem</li>
<li><code>-s, --capture=method</code>: method should be one of <code>fd|sys|no</code>. <code>-s</code> is shortcut for <code>--capture=no</code></li>
<li><code>–lf, --last-failed</code>: only run last failing tests, or use <code>–ff, –failed-first</code></li>
<li><code>-l, --showlocals</code>: local variables and their values are displayed with tracebacks for failing tests</li>
<li><code>--tb=style</code>: useful styles <code>short</code>, <code>line</code>, and <code>no</code></li>
<li><code>--durations=N</code>: show N slowest setup/test durations (N=0 for all), helpful to speed up testing</li>
</ul>
</div>
</div>

<div id="outline-container-org935c7e8" class="outline-3">
<h3 id="org935c7e8"><span class="section-number-3">1.3</span> Plugin Options</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li><code>--pdb</code></li>
<li><code>--cov</code>, <code>--cov-report=html</code></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org7efa54d" class="outline-2">
<h2 id="org7efa54d"><span class="section-number-2">2</span> Markers</h2>
<div class="outline-text-2" id="text-2">
<p>
Markers are one of the best ways to mark a subset of your test functions so that they can be run together.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">import</span> pytest

<span style="color: #ba2f59; font-weight: bold;">@pytest.mark.somemark</span>
<span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">test_func</span>():
    <span style="color: #3a81c3; font-weight: bold;">pass</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-bash">pytest -v -m <span style="color: #2d9574;">'some mark'</span>
</pre>
</div>
</div>
<div id="outline-container-org0c0c07d" class="outline-3">
<h3 id="org0c0c07d"><span class="section-number-3">2.1</span> Skip Test on Some Versions</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #ba2f59; font-weight: bold;">@pytest.mark.skipif</span>(tasks.__version__ &lt; &#8203;<span style="color: #2d9574;">'0.2.0'</span>&#8203;,
                    reason=&#8203;<span style="color: #2d9574;">'not supported until version 0.2.0'</span>&#8203;)
</pre>
</div>
</div>
</div>

<div id="outline-container-org072bb04" class="outline-3">
<h3 id="org072bb04"><span class="section-number-3">2.2</span> Parametrized</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Parametrized testing is a way to send multiple sets of data through the same test and
have pytest report if any of the sets failed. <code>@pytest.mark.parametrize</code>
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #ba2f59; font-weight: bold;">@pytest.mark.parametrize</span>(<span style="color: #2d9574;">'arg1,arg2'</span>, [(1, <span style="color: #2d9574;">'arg2_value1'</span>), (2, <span style="color: #2d9574;">'arg2_value2'</span>)])
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org7bd5b47" class="outline-2">
<h2 id="org7bd5b47"><span class="section-number-2">3</span> Fixtures</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgbf92078" class="outline-3">
<h3 id="orgbf92078"><span class="section-number-3">3.1</span> Tracing Fixture Execution</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li><code>--setup-show</code></li>
</ul>
</div>
</div>

<div id="outline-container-orgeb9e73a" class="outline-3">
<h3 id="orgeb9e73a"><span class="section-number-3">3.2</span> Data Fixture</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #ba2f59; font-weight: bold;">@pytest.fixture</span>(name=<span style="color: #2d9574;">'show_on_result'</span>, scope=<span style="color: #2d9574;">'session'</span>)
<span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">a_tuple</span>():
    <span style="color: #3a81c3; font-weight: bold;">return</span> (1, 2, 3)
</pre>
</div>
</div>
</div>

<div id="outline-container-org31f67f6" class="outline-3">
<h3 id="org31f67f6"><span class="section-number-3">3.3</span> Fixtures for Resource</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #ba2f59; font-weight: bold;">@pytest.fixture</span>()
<span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">resource</span>():
    <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Setup</span>
    <span style="color: #3a81c3; font-weight: bold;">yield</span>
    <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Teardown</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org11d01c7" class="outline-3">
<h3 id="org11d01c7"><span class="section-number-3">3.4</span> Specifying Fixtures with <code>usefixtures</code></h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li><code>@pytest.mark.usefixtures('fixture1', 'fixture2')</code></li>
</ul>
</div>
</div>

<div id="outline-container-org3e7d7b9" class="outline-3">
<h3 id="org3e7d7b9"><span class="section-number-3">3.5</span> Fixture Scope</h3>
<div class="outline-text-3" id="text-3-5">
<p>
function(default), class, module, session
</p>
</div>
<div id="outline-container-org5cfff88" class="outline-4">
<h4 id="org5cfff88"><span class="section-number-4">3.5.1</span> Class Scope</h4>
<div class="outline-text-4" id="text-3-5-1">
<ul class="org-ul">
<li>need to use <code>usefixtures</code></li>
</ul>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">class scope</span>
<span style="color: #ba2f59; font-weight: bold;">@pytest.fixture</span>(scope=&#8203;<span style="color: #2d9574;">'class'</span>&#8203;)
&#8203;<span style="color: #3a81c3; font-weight: bold;">def</span>&#8203; <span style="color: #6c3163; font-weight: bold;">class_scope</span>():
    <span style="color: #da8b55;">"""A class scope fixture."""</span>

<span style="color: #ba2f59; font-weight: bold;">@pytest.mark.usefixtures</span>(&#8203;<span style="color: #2d9574;">'class_scope'</span>&#8203;)
<span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">TestClass</span>:
    <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">test_method</span>(<span style="color: #3a81c3; font-weight: bold;">self</span>):
        <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">use class_scope fixture</span>
        <span style="color: #3a81c3; font-weight: bold;">pass</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org94930e5" class="outline-3">
<h3 id="org94930e5"><span class="section-number-3">3.6</span> Autouse Fixture</h3>
<div class="outline-text-3" id="text-3-6">
<ul class="org-ul">
<li><code>@pytest.fixture(autouse=True)</code></li>
</ul>
</div>
</div>

<div id="outline-container-org981c29e" class="outline-3">
<h3 id="org981c29e"><span class="section-number-3">3.7</span> Renaming Fixture</h3>
<div class="outline-text-3" id="text-3-7">
<ul class="org-ul">
<li><code>@pytest.fixture(name='simple')</code></li>
<li>Use <code>--fixtures</code> option to list all the fixtures available for the test</li>
</ul>
</div>
</div>

<div id="outline-container-orgf135458" class="outline-3">
<h3 id="orgf135458"><span class="section-number-3">3.8</span> <b>Parametrizing Fixtures</b></h3>
<div class="outline-text-3" id="text-3-8">
<ul class="org-ul">
<li><code>@pytest.fixture(params=tasks_to_try, ids=task_ids)</code></li>
<li>With parametrized fixtures, every test function that uses that fixture will be called multiple times.</li>
<li>Use <code>ids</code> to specify fixture identities.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgaf765f4" class="outline-2">
<h2 id="orgaf765f4"><span class="section-number-2">4</span> Builtin Fixtures</h2>
<div class="outline-text-2" id="text-4">
</div>
