python/pytest.html
<div id="outline-container-orgc700fb9" class="outline-3">
<h3 id="orgc700fb9"><span class="section-number-3">4.1</span> <code>tmpdir</code> &amp; <code>tmpdir_factory</code></h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>We get session scope temporary directories and files from the <code>tmpdir_factory</code> fixture, and function scope directories and files from the <code>tmpdir</code> fixture.</li>
</ul>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">a_dir</span> = tmpdir_factory.mktemp(&#8203;<span style="color: #2d9574;">'mydir'</span>&#8203;)
<span style="color: #715ab1;">a_file</span> = a_dir.join(&#8203;<span style="color: #2d9574;">'something.txt'</span>&#8203;)
<span style="color: #715ab1;">a_sub_dir</span> = a_dir.mkdir(&#8203;<span style="color: #2d9574;">'anything'</span>&#8203;)
<span style="color: #715ab1;">another_file</span> = a_sub_dir.join(&#8203;<span style="color: #2d9574;">'something_else.txt'</span>&#8203;)
a_file.write(&#8203;<span style="color: #2d9574;">'contents may settle during shipping'</span>&#8203;)
<span style="color: #3a81c3; font-weight: bold;">assert</span>&#8203; a_file.read() == &#8203;<span style="color: #2d9574;">'contents may settle during shipping'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc7acc0d" class="outline-3">
<h3 id="orgc7acc0d"><span class="section-number-3">4.2</span> request</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>Used with fixture parametrization <code>request.param</code></li>
</ul>
</div>
</div>

<div id="outline-container-org0bb7bb5" class="outline-3">
<h3 id="org0bb7bb5"><span class="section-number-3">4.3</span> pytestconfig</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li><p>
Adding command-line options via pytest_addoption should be done via plugins or in the <code>conftest.py</code> file at the top of your project directory structure.
</p>
<div class="org-src-container">
<pre class="src src-python">            &#8203;<span style="color: #3a81c3; font-weight: bold;">def</span>&#8203; <span style="color: #6c3163; font-weight: bold;">pytest_addoption</span>(parser):
                parser.addoption(&#8203;<span style="color: #2d9574;">"--myopt"</span>&#8203;, action=&#8203;<span style="color: #2d9574;">"store_true"</span>&#8203;,
                                 <span style="color: #3a81c3;">help</span>=&#8203;<span style="color: #2d9574;">"some boolean option"</span>&#8203;)
                parser.addoption(&#8203;<span style="color: #2d9574;">"--foo"</span>&#8203;, action=&#8203;<span style="color: #2d9574;">"store"</span>&#8203;, default=&#8203;<span style="color: #2d9574;">"bar"</span>&#8203;,
                                 <span style="color: #3a81c3;">help</span>=&#8203;<span style="color: #2d9574;">"foo: bar or baz"</span>&#8203;)
</pre>
</div></li>
</ul>
<ul class="org-ul">
<li><p>
Using options
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">def</span>&#8203; <span style="color: #6c3163; font-weight: bold;">test_option</span>(pytestconfig):
    <span style="color: #3a81c3; font-weight: bold;">print</span>&#8203;(&#8203;<span style="color: #2d9574;">'"foo" set to:'</span>&#8203;, pytestconfig.getoption(&#8203;<span style="color: #2d9574;">'foo'</span>&#8203;))
    <span style="color: #3a81c3; font-weight: bold;">print</span>&#8203;(&#8203;<span style="color: #2d9574;">'"myopt" set to:'</span>&#8203;, pytestconfig.getoption(&#8203;<span style="color: #2d9574;">'myopt'</span>&#8203;))
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-orgdb468ba" class="outline-3">
<h3 id="orgdb468ba"><span class="section-number-3">4.4</span> cache</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Storing information about one test session and retrieving it in the next. examples: <code>--lf</code>, <code>--ff</code>
</p>
<ul class="org-ul">
<li>command line options: <code>--cache-show</code>, <code>--cache-clear</code></li>
<li><code>cache.get</code>, <code>cache.set</code></li>
<li>By convention, key names start with the name of your application or plugin, followed by a /,</li>
</ul>
<p>
and continuing to separate sections of the key name with /’s. The value you store can be anything
that is convertible to json, since that’s how it’s represented in the .cache directory.
</p>
<ul class="org-ul">
<li><code>cache</code> is function scope fixture, using <code>request.config.cache</code> in any other scopes.</li>
</ul>
</div>
</div>

<div id="outline-container-org3d94e99" class="outline-3">
<h3 id="org3d94e99"><span class="section-number-3">4.5</span> capsys</h3>
<div class="outline-text-3" id="text-4-5">
<ul class="org-ul">
<li><code>out, err = capsys.readouterr()</code></li>
</ul>
</div>
</div>

<div id="outline-container-orgbe43414" class="outline-3">
<h3 id="orgbe43414"><span class="section-number-3">4.6</span> monkeypatch</h3>
<div class="outline-text-3" id="text-4-6">
<ul class="org-ul">
<li><code>setattr</code>, <code>delattr</code>: Set/Delete an attribute.</li>
<li><code>setitem</code>, <code>delitem</code>: Set/Delete a dictionary entry.</li>
<li><code>setenv</code>, <code>delenv</code>: Set/Delete an environmental variable.</li>
<li><code>syspath_prepend</code>: Prepend path to <code>sys.path</code></li>
<li><code>chdir</code>: Change the current working directory.</li>
<li>examples:</li>
</ul>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">def</span>&#8203; <span style="color: #6c3163; font-weight: bold;">test_def_prefs_change_home</span>(tmpdir, monkeypatch):
    monkeypatch.setenv(&#8203;<span style="color: #2d9574;">'HOME'</span>&#8203;, tmpdir.mkdir(&#8203;<span style="color: #2d9574;">'home'</span>&#8203;))
    cheese.write_default_cheese_preferences()
    <span style="color: #715ab1;">expected</span> = cheese._default_prefs
    <span style="color: #715ab1;">actual</span> = cheese.read_cheese_preferences()
    <span style="color: #3a81c3; font-weight: bold;">assert</span>&#8203; expected == actual

<span style="color: #715ab1;">fake_home_dir</span> = tmpdir.mkdir(&#8203;<span style="color: #2d9574;">'home'</span>&#8203;)
monkeypatch.<span style="color: #3a81c3;">setattr</span>(cheese.os.path, &#8203;<span style="color: #2d9574;">'expanduser'</span>&#8203;,
                    (&#8203;<span style="color: #3a81c3; font-weight: bold;">lambda</span>&#8203; x: x.replace(&#8203;<span style="color: #2d9574;">'~'</span>&#8203;, <span style="color: #3a81c3;">str</span>(fake_home_dir))))
</pre>
</div>
<ul class="org-ul">
<li><code>monkeypatch</code> fixture functions can be in conjunction with <code>unittest.mock</code> to temporarily replace attributes with mock objects</li>
</ul>
</div>
</div>

<div id="outline-container-org57432e5" class="outline-3">
<h3 id="org57432e5"><span class="section-number-3">4.7</span> doctest_namespace</h3>
</div>
<div id="outline-container-org06427ab" class="outline-3">
<h3 id="org06427ab"><span class="section-number-3">4.8</span> recwarn</h3>
<div class="outline-text-3" id="text-4-8">
<ul class="org-ul">
<li>Examine <code>warnings</code> generated by code under test</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org5ebdc4e" class="outline-2">
<h2 id="org5ebdc4e"><span class="section-number-2">5</span> Mocks</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><code>mocker.patch</code></li>
<li><code>mocker.patch.object</code></li>
</ul>
</div>
</div>

<div id="outline-container-org13c27ec" class="outline-2">
<h2 id="org13c27ec"><span class="section-number-2">6</span> Asycnio</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgba6d4c4" class="outline-3">
<h3 id="orgba6d4c4"><span class="section-number-3">6.1</span> <code>pytest-asyncio</code></h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li><code>@pytest.fixture</code> can decorate coroutines or async generators</li>
<li>custom event loop</li>
<li><code>@pytest.mark.asyncio</code></li>
</ul>
</div>
</div>

<div id="outline-container-org2734ecf" class="outline-3">
<h3 id="org2734ecf"><span class="section-number-3">6.2</span> <code>asynctest</code></h3>
<div class="outline-text-3" id="text-6-2">
</div>
<div id="outline-container-org9787a19" class="outline-4">
<h4 id="org9787a19"><span class="section-number-4">6.2.1</span> Mock</h4>
<div class="outline-text-4" id="text-6-2-1">
<ul class="org-ul">
<li><code>asynctest.Mock(object)</code></li>
<li><code>asynctest.create_autospec(class/func)</code>: to create mock objects</li>
<li><code>side_effect</code> can be a function, an exception object or class or any iterable object.</li>
<li>Putting it all together</li>
</ul>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">import</span> asynctest
<span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">TestCacheWithMagicMethods</span>(asynctest.TestCase):
    <span style="color: #3a81c3; font-weight: bold;">async def</span> <span style="color: #6c3163; font-weight: bold;">test_one_user_added_to_cache</span>(<span style="color: #3a81c3; font-weight: bold;">self</span>):
        <span style="color: #715ab1;">user</span> = StubClient.User(1, <span style="color: #2d9574;">"a.dmin"</span>)

        <span style="color: #715ab1;">AsyncClientMock</span> = asynctest.create_autospec(AsyncClient)

        <span style="color: #715ab1;">transaction</span> = asynctest.MagicMock()
        <span style="color: #715ab1;">transaction.__aenter__.side_effect</span> = AsyncClientMock

        <span style="color: #715ab1;">cursor</span> = asynctest.MagicMock()
        <span style="color: #715ab1;">cursor.__aiter__.return_value</span> = [user]

        <span style="color: #715ab1;">client</span> = AsyncClientMock()
        <span style="color: #715ab1;">client.new_transaction.return_value</span> = transaction
        <span style="color: #715ab1;">client.get_users_cursor.return_value</span> = cursor

        <span style="color: #715ab1;">cache</span> = {}

        <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">The user has been added to the cache</span>
        <span style="color: #715ab1;">nb_added</span> = <span style="color: #3a81c3; font-weight: bold;">await</span> cache_users_with_cursor(client, cache)

        <span style="color: #3a81c3; font-weight: bold;">self</span>.assertEqual(nb_added, 1)
        <span style="color: #3a81c3; font-weight: bold;">self</span>.assertEqual(cache[1], user)

        <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">The user was already there</span>
        <span style="color: #715ab1;">nb_added</span> = <span style="color: #3a81c3; font-weight: bold;">await</span> cache_users_with_cursor(client, cache)
        <span style="color: #3a81c3; font-weight: bold;">self</span>.assertEqual(nb_added, 0)
        <span style="color: #3a81c3; font-weight: bold;">self</span>.assertEqual(cache[1], user)
</pre>
</div>
</div>
</div>
