org/python/pytest.org
*** Patching
    Patching is especially useful when one need a mock, but can't pass it as a parameter of the function to be tested.
    - When an object is hard to mock, it sometimes shows a *limitation in the design*: a coupling that is too tight
    #+BEGIN_SRC python
      with asynctest.patch("logging.debug") as debug_mock:
          await cache_users_async(client, cache)
      debug_mock.assert_called()

      # or
      @asynctest.patch("logging.error")
      @asynctest.patch("logging.debug")
      async def test_with_decorator(self, debug_mock, error_mock):
          ...
    #+END_SRC
