python/pytest.html
<div id="outline-container-org87c2644" class="outline-4">
<h4 id="org87c2644"><span class="section-number-4">6.2.2</span> Patching</h4>
<div class="outline-text-4" id="text-6-2-2">
<p>
Patching is especially useful when one need a mock, but can't pass it as a parameter of the function to be tested.
</p>
<ul class="org-ul">
<li>When an object is hard to mock, it sometimes shows a <b>limitation in the design</b>: a coupling that is too tight</li>
</ul>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">with</span> asynctest.patch(<span style="color: #2d9574;">"logging.debug"</span>) <span style="color: #3a81c3; font-weight: bold;">as</span> debug_mock:
    <span style="color: #3a81c3; font-weight: bold;">await</span> cache_users_async(client, cache)
debug_mock.assert_called()

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">or</span>
<span style="color: #ba2f59; font-weight: bold;">@asynctest.patch</span>(<span style="color: #2d9574;">"logging.error"</span>)
<span style="color: #ba2f59; font-weight: bold;">@asynctest.patch</span>(<span style="color: #2d9574;">"logging.debug"</span>)
<span style="color: #3a81c3; font-weight: bold;">async def</span> <span style="color: #6c3163; font-weight: bold;">test_with_decorator</span>(<span style="color: #3a81c3; font-weight: bold;">self</span>, debug_mock, error_mock):
    ...
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
